# Pivoting and Melting DataFrames

In [36]:
import pandas as pd

In [19]:
data = pd.read_excel('pivot_melting.xlsx')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1732 entries, 0 to 1731
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order_Number  1732 non-null   int64
 1   State_Code    1732 non-null   object
 2   Order_Date    1732 non-null   datetime64[ns]
 3   Month         1732 non-null   object
 4   Status        1732 non-null   object
 5   Product       1732 non-null   object
 6   Category      1732 non-null   object
 7   Brand         1732 non-null   object
 8   Total_Cost    1732 non-null   int64
 9   Total_Sales   1732 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(6)
memory usage: 135.4+ KB

### Pivot Data (Values, Row, Columns)

In [26]:
pivot_data = data.pivot_table("Total_Sales", "Month", "Status")
pivot_data

Status     Delivered         Order    Processing       Shipped
Month
Apr     22850.750000  22348.876289  15436.092784  18175.608247
Aug     22688.714286  19321.250000   8082.750000  16896.750000
Dec     20123.365854  22772.750000  15713.425000  17690.400000
Feb     23673.000000  18736.250000  13650.000000  20616.555556
Jan     22208.333333  23538.000000  18363.000000   9246.000000
Jul     21162.916667  23012.363636  17329.000000  13811.909091
Jun     19636.933333  20313.800000  22060.071429  16422.466667
Mar     22370.355932  22352.508475  17585.915254  16823.666667
May     24202.075472  18963.811321  13461.132075  14758.188679
Nov     20257.421053  22803.300000  17190.550000  16938.315789
Oct     29012.100000  21645.000000  15085.777778  12797.200000
Sep     22752.536585  23285.853659  16496.682927  14142.731707

#### Melting Data

In [32]:
df = {
    'Name' : ['Asif', 'Kashif', 'Nasir', 'Ahmed'],
    'Houses': ['Red', 'Blue', 'Red','Blue'],
    'Grades' : ['3rd', '8th', '9th', '10th']
}

data2 = pd.DataFrame(df)
data2

     Name Houses Grades
0    Asif    Red    3rd
1  Kashif   Blue    8th
2   Nasir    Red    9th
3   Ahmed   Blue   10th